In [4]:
# 1. Create a Pandas Series using a list of 5 random numbers and custom index names.
#     Then print the series and its data type.

# 2. Create a DataFrame with columns: "Student_Name", "Maths", "Science", "English".
#     Fill it with 5 sample student records and display the top 3 rows using head().

# 3. Import a CSV file (use any sample dataset) into a DataFrame.
#     Display the number of rows and columns using shape, and print column names.

# 4. Add a new column named "Total_Marks" that sums all three subject scores.
#     Then create another column "Average" by dividing Total_Marks by 3.

# 5. Introduce a missing value (NaN) in the "Science" column and then:
#     (a) Identify missing values using isnull()
#     (b) Replace the missing value with the column mean using fillna().

# 6. Filter and display all students whose "Average" score is greater than 75.

# 7. Sort the DataFrame by "Total_Marks" in descending order and show the top 3 performers.

# 8. Group students based on their "English" score range (like above or below 70)
#     and find the mean of "Maths" and "Science" marks for each group.

# 9. Merge two DataFrames:
#     (a) One with "Student_Name" and "Total_Marks"
#     (b) Another with "Student_Name" and "Sports_Score"
#     Then create a new column "Overall_Score" = Total_Marks + Sports_Score.

# 10. Export the final DataFrame to a CSV file on your Desktop (use os library to define path)
#     and verify if the file is successfully created using os.path.exists().

In [5]:
# 1. Create a Pandas Series using a list of 5 random numbers and custom index names.
#     Then print the series and its data type.
import pandas as pd
import numpy as np
data = [10,20,30,40,50]
series = pd.Series(data, index=['A','B','C','D','E'])
print(series)

A    10
B    20
C    30
D    40
E    50
dtype: int64

In [6]:
# 2. Create a DataFrame with columns: "Student_Name", "Maths", "Science", "English".
# Fill it with 5 sample student records and display the top 3 rows using head().
data_stud={'Student_Name':['Alice','Bob','Charlie','John','Alex'],
           'Maths':[90,80,65,75,67],
            'Science':[80,64,68,90,88],
             'English':[79,80,85,63,62]
          }
data=pd.DataFrame(data_stud)
data.head(3)

  Student_Name  Maths  Science  English
0        Alice     90       80       79
1          Bob     80       64       80
2      Charlie     65       68       85

In [7]:
# 3. Import a CSV file (use any sample dataset) into a DataFrame.
#     Display the number of rows and columns using shape, and print column names.
student=pd.read_csv(r"C:\Users\Expert\Downloads\data.csv")
print(student)
print("Student Shape:",student.shape)

   Name  Age    City
0  Isha   22    Pune
1  Amit   25  Mumbai
2  Neha   24   Delhi
Student Shape: (3, 3)

In [8]:
# 4. Add a new column named "Total_Marks" that sums all three subject scores.
#     Then create another column "Average" by dividing Total_Marks by 3.
data_stud={'Student_Name':['Alice','Bob','Charlie','John','Alex'],
           'Maths':[90,80,65,75,67],
            'Science':[80,64,68,90,88],
             'English':[79,80,85,63,62]
          }
data=pd.DataFrame(data_stud)
data['Total']=data['Maths'] + data['Science'] + data['English']
data['Average']= (data['Total'] / 3)
print(data.head())

  Student_Name  Maths  Science  English  Total    Average
0        Alice     90       80       79    249  83.000000
1          Bob     80       64       80    224  74.666667
2      Charlie     65       68       85    218  72.666667
3         John     75       90       63    228  76.000000
4         Alex     67       88       62    217  72.333333

In [9]:
# 5. Introduce a missing value (NaN) in the "Science" column and then:
data.loc[2,'Science'] = None
print("with missing data:\n",data)

# (a) Identify missing values using isnull()
print(data.isnull())

# (b) Replace the missing value with the column mean using fillna().
data['Science']=data['Science'].fillna(data['Science'].mean())
print("\n", data)

with missing data:
   Student_Name  Maths  Science  English  Total    Average
0        Alice     90     80.0       79    249  83.000000
1          Bob     80     64.0       80    224  74.666667
2      Charlie     65      NaN       85    218  72.666667
3         John     75     90.0       63    228  76.000000
4         Alex     67     88.0       62    217  72.333333
   Student_Name  Maths  Science  English  Total  Average
0         False  False    False    False  False    False
1         False  False    False    False  False    False
2         False  False     True    False  False    False
3         False  False    False    False  False    False
4         False  False    False    False  False    False

   Student_Name  Maths  Science  English  Total    Average
0        Alice     90     80.0       79    249  83.000000
1          Bob     80     64.0       80    224  74.666667
2      Charlie     65     80.5       85    218  72.666667
3         John     75     90.0       63    228  76.000000
4         Alex     67     88.0       62    217  72.333333

In [10]:
# 6. Filter and display all students whose "Average" score is greater than 75.
print(data[data['Average'] > 75])

  Student_Name  Maths  Science  English  Total  Average
0        Alice     90     80.0       79    249     83.0
3         John     75     90.0       63    228     76.0

In [11]:
# 7. Sort the DataFrame by "Total_Marks" in descending order and show the top 3 performers.
data=data.sort_values(by='Total', ascending=False)
print(data)
data.head(3)

  Student_Name  Maths  Science  English  Total    Average
0        Alice     90     80.0       79    249  83.000000
3         John     75     90.0       63    228  76.000000
1          Bob     80     64.0       80    224  74.666667
2      Charlie     65     80.5       85    218  72.666667
4         Alex     67     88.0       62    217  72.333333

  Student_Name  Maths  Science  English  Total    Average
0        Alice     90     80.0       79    249  83.000000
3         John     75     90.0       63    228  76.000000
1          Bob     80     64.0       80    224  74.666667

In [12]:
# 8. Group students based on their "English" score range (like above or below 70)
# and find the mean of "Maths" and "Science" marks for each group.
data['English_Group']= np.where(data['English'] > 70, 
                                'Above 70',
                                'Below 70')
result= data.groupby('English_Group')[['Maths','Science']].mean()
print(result)

                   Maths    Science
English_Group
Above 70       78.333333  74.833333
Below 70       71.000000  89.000000

In [17]:
# 9. Merge two DataFrames:
#     (a) One with "Student_Name" and "Total_Marks"
#     (b) Another with "Student_Name" and "Sports_Score"
#     Then create a new column "Overall_Score" = Total_Marks + Sports_Score.
data1 = pd.DataFrame({
    'Student_Name':['Alice','Bob','Charlie','David','Eva'],
    'Total_Marks':[249,224,218,228,217],
})
data2 = pd.DataFrame({
    'Student_Name':['Alice','Bob','Charlie','David','Eva'],
    'Sports_Score':[10,9,8,7,6]
})
merged_data = pd.merge(data1, data2, on='Student_Name')  

merged_data['Overall_Score']= merged_data['Total_Marks'] + merged_data['Sports_Score']
print(merged_data)

  Student_Name  Total_Marks  Sports_Score  Overall_Score
0        Alice          249            10            259
1          Bob          224             9            233
2      Charlie          218             8            226
3        David          228             7            235
4          Eva          217             6            223

In [21]:
# 10. Export the final DataFrame to a CSV file on your Desktop (use os library to define path)
#     and verify if the file is successfully created using os.path.exists().
import os
user_name=os.getlogin()

export_path=r"C:\Users\Expert\OneDrive\Documents\final.csv"
merged_data.to_csv(export_path, index=False)
print(f"Data exported successfully to:{export_path}")

Data exported successfully to:C:\Users\Expert\OneDrive\Documents\final.csv